tutorials/incompressibleVoF/floatingObjectWaves/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

origin          (0 0 0.5);

direction       (1 1 0);

waves
(
    Stokes5
    {
        length      0.5;
        amplitude   0.03;
        depth       0.5;
        phase       0;
        angle       0;
    }
);

UMean           (0 0 0);

// ************************************************************************* //
